Import Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

Load Dataset

In [2]:
data = pd.read_csv(r"C:\Users\91989\Downloads\Titanic Dataset For Native SoftTech.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

 Handle Missing Values

In [3]:
data['Age'] = data['Age'].fillna(data['Age'].median())
data['Embarked'] = data['Embarked'].fillna(data['Embarked'].mode()[0])

Drop Irrelevant Column

In [4]:
data.drop(columns=['Cabin'], inplace=True)

Check for Remaining Missing Values

In [5]:
print(data.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Embarked       0
dtype: int64

Handle Outliers in Fare

In [6]:
Q1 = data['Fare'].quantile(0.25)
Q3 = data['Fare'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

data = data[(data['Fare'] >= lower_bound) & (data['Fare'] <= upper_bound)]

Convert PassengerId to Categorical

In [7]:
data['PassengerId'] = data['PassengerId'].astype('category')

Normalize Numerical Features

In [8]:
from sklearn.preprocessing import StandardScaler

# Select numerical features
numerical_features = ['Age', 'Fare']

# Initialize the StandardScaler
scaler = StandardScaler()

# Normalize the numerical features
data[numerical_features] = scaler.fit_transform(data[numerical_features])

Feature Engineering: Family Size

In [9]:
data['FamilySize'] = data['SibSp'] + data['Parch'] + 1

One-Hot Encoding

In [10]:
data = pd.get_dummies(data, columns=['Sex', 'Embarked'], drop_first=True)

Drop Irrelevant Columns

In [11]:
data.drop(columns=['Name', 'Ticket', 'PassengerId'], inplace=True)

Final Dataset Check

In [12]:
data.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,FamilySize,Sex_male,Embarked_Q,Embarked_S
0,0,3,0.588694,0,0,-0.727059,1,1,1,0
1,1,3,1.704206,1,0,-0.784848,2,0,0,1
2,0,2,3.042820,0,0,-0.597552,1,1,1,0
3,0,3,-0.080613,0,0,-0.668986,1,1,0,1
4,1,3,-0.526817,1,1,-0.416354,3,0,0,1